of90/tutorials/rheoFoam/fluidDamper/CarreauYasuda/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{

                type            CarreauYasuda;
                
                rho             rho   [1 -3 0 0 0 0 0] 1000;
                eta0            eta0   [ 1 -1 -1 0 0 0 0 ] 100; 
   		etaInf          etaInf  [ 1 -1 -1 0 0 0 0 ] 0.; 
   		k               k     [ 0 0 1 0 0 0 0 ] 0.0084033613; 
   		n               n     [ 0 0 0 0 0 0 0 ] 0.353;   
   		a               a     [ 0 0 0 0 0 0 0 ] 1.433;
   		
}

passiveScalarProperties
{

                solvePassiveScalar   off;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
